Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_tim20.h
#define TIM20_SR_TERRF_B_0X0        (0x0u<<23)
#define TIM20_SR_TERRF_B_0X1        (0x1u<<23)
#define TIM20_SR_IERRF_B_0X0        (0x0u<<22)
#define TIM20_SR_IERRF_B_0X1        (0x1u<<22)
#define TIM20_SR_DIRF_B_0X0         (0x0u<<21)
#define TIM20_SR_DIRF_B_0X1         (0x1u<<21)
#define TIM20_SR_IDXF_B_0X0         (0x0u<<20)
#define TIM20_SR_IDXF_B_0X1         (0x1u<<20)
#define TIM20_SR_SBIF_B_0X0         (0x0u<<13)
#define TIM20_SR_SBIF_B_0X1         (0x1u<<13)
#define TIM20_SR_CC1OF_B_0X0        (0x0u<<9)
#define TIM20_SR_CC1OF_B_0X1        (0x1u<<9)
#define TIM20_SR_B2IF_B_0X0         (0x0u<<8)
#define TIM20_SR_B2IF_B_0X1         (0x1u<<8)
#define TIM20_SR_BIF_B_0X0          (0x0u<<7)
#define TIM20_SR_BIF_B_0X1          (0x1u<<7)
#define TIM20_SR_TIF_B_0X0          (0x0u<<6)
#define TIM20_SR_TIF_B_0X1          (0x1u<<6)
#define TIM20_SR_COMIF_B_0X0        (0x0u<<5)
#define TIM20_SR_COMIF_B_0X1        (0x1u<<5)
#define TIM20_SR_CC1IF_B_0X0        (0x0u<<1)
#define TIM20_SR_CC1IF_B_0X1        (0x1u<<1)
#define TIM20_SR_UIF_B_0X0          (0x0u<<0)
#define TIM20_SR_UIF_B_0X1          (0x1u<<0)

// EGR Configuration

#define TIM20_EGR_B2G               (0x1u<<8)
#define TIM20_EGR_BG                (0x1u<<7)
#define TIM20_EGR_TG                (0x1u<<6)
#define TIM20_EGR_COMG              (0x1u<<5)
#define TIM20_EGR_CC4G              (0x1u<<4)
#define TIM20_EGR_CC3G              (0x1u<<3)
#define TIM20_EGR_CC2G              (0x1u<<2)
#define TIM20_EGR_CC1G              (0x1u<<1)
#define TIM20_EGR_UG                (0x1u<<0)

#define TIM20_EGR_B2G_B_0X0         (0x0u<<8)
#define TIM20_EGR_B2G_B_0X1         (0x1u<<8)
#define TIM20_EGR_BG_B_0X0          (0x0u<<7)
#define TIM20_EGR_BG_B_0X1          (0x1u<<7)
#define TIM20_EGR_TG_B_0X0          (0x0u<<6)
#define TIM20_EGR_TG_B_0X1          (0x1u<<6)
#define TIM20_EGR_COMG_B_0X0        (0x0u<<5)
#define TIM20_EGR_COMG_B_0X1        (0x1u<<5)
#define TIM20_EGR_CC1G_B_0X0        (0x0u<<1)
#define TIM20_EGR_CC1G_B_0X1        (0x1u<<1)
#define TIM20_EGR_UG_B_0X0          (0x0u<<0)
#define TIM20_EGR_UG_B_0X1          (0x1u<<0)

// CCMR1 Configuration

#define TIM20_CCMR1_IC2F            (0xFu<<12)
#define TIM20_CCMR1_IC2F_0          (0x1u<<12)
#define TIM20_CCMR1_IC2PSC          (0x3u<<10)
#define TIM20_CCMR1_IC2PSC_0        (0x1u<<10)
#define TIM20_CCMR1_CC2S            (0x3u<<8)
#define TIM20_CCMR1_CC2S_0          (0x1u<<8)
#define TIM20_CCMR1_IC1F            (0xFu<<4)
#define TIM20_CCMR1_IC1F_0          (0x1u<<4)
#define TIM20_CCMR1_IC1PSC          (0x3u<<2)
#define TIM20_CCMR1_IC1PSC_0        (0x1u<<2)
#define TIM20_CCMR1_CC1S            (0x3u<<0)
#define TIM20_CCMR1_CC1S_0          (0x1u<<0)

#define TIM20_CCMR1_CC2S_B_0X0      (0x0u<<8)
#define TIM20_CCMR1_CC2S_B_0X1      (0x1u<<8)
#define TIM20_CCMR1_CC2S_B_0X2      (0x2u<<8)
#define TIM20_CCMR1_CC2S_B_0X3      (0x3u<<8)
#define TIM20_CCMR1_IC1F_B_0X0      (0x0u<<4)
#define TIM20_CCMR1_IC1F_B_0X1      (0x1u<<4)
#define TIM20_CCMR1_IC1F_B_0X2      (0x2u<<4)
#define TIM20_CCMR1_IC1F_B_0X3      (0x3u<<4)
#define TIM20_CCMR1_IC1F_B_0X4      (0x4u<<4)
#define TIM20_CCMR1_IC1F_B_0X5      (0x5u<<4)
#define TIM20_CCMR1_IC1F_B_0X6      (0x6u<<4)
#define TIM20_CCMR1_IC1F_B_0X7      (0x7u<<4)
#define TIM20_CCMR1_IC1F_B_0X8      (0x8u<<4)
#define TIM20_CCMR1_IC1F_B_0X9      (0x9u<<4)
#define TIM20_CCMR1_IC1F_B_0XA      (0xAu<<4)
#define TIM20_CCMR1_IC1F_B_0XB      (0xBu<<4)
#define TIM20_CCMR1_IC1F_B_0XC      (0xCu<<4)
#define TIM20_CCMR1_IC1F_B_0XD      (0xDu<<4)
#define TIM20_CCMR1_IC1F_B_0XE      (0xEu<<4)
#define TIM20_CCMR1_IC1F_B_0XF      (0xFu<<4)
#define TIM20_CCMR1_IC1PSC_B_0X0    (0x0u<<2)
#define TIM20_CCMR1_IC1PSC_B_0X1    (0x1u<<2)
#define TIM20_CCMR1_IC1PSC_B_0X2    (0x2u<<2)
#define TIM20_CCMR1_IC1PSC_B_0X3    (0x3u<<2)
#define TIM20_CCMR1_CC1S_B_0X0      (0x0u<<0)
#define TIM20_CCMR1_CC1S_B_0X1      (0x1u<<0)
#define TIM20_CCMR1_CC1S_B_0X2      (0x2u<<0)
#define TIM20_CCMR1_CC1S_B_0X3      (0x3u<<0)

// CCMR2 Configuration

#define TIM20_CCMR2_IC4F            (0xFu<<12)
#define TIM20_CCMR2_IC4F_0          (0x1u<<12)
#define TIM20_CCMR2_IC4PSC          (0x3u<<10)
#define TIM20_CCMR2_IC4PSC_0        (0x1u<<10)
#define TIM20_CCMR2_CC4S            (0x3u<<8)
#define TIM20_CCMR2_CC4S_0          (0x1u<<8)
#define TIM20_CCMR2_IC3F            (0xFu<<4)
#define TIM20_CCMR2_IC3F_0          (0x1u<<4)
#define TIM20_CCMR2_IC3PSC          (0x3u<<2)
#define TIM20_CCMR2_IC3PSC_0        (0x1u<<2)
#define TIM20_CCMR2_CC3S            (0x3u<<0)
#define TIM20_CCMR2_CC3S_0          (0x1u<<0)

#define TIM20_CCMR2_CC4S_B_0X0      (0x0u<<8)
#define TIM20_CCMR2_CC4S_B_0X1      (0x1u<<8)
#define TIM20_CCMR2_CC4S_B_0X2      (0x2u<<8)
#define TIM20_CCMR2_CC4S_B_0X3      (0x3u<<8)
#define TIM20_CCMR2_CC3S_B_0X0      (0x0u<<0)
#define TIM20_CCMR2_CC3S_B_0X1      (0x1u<<0)
#define TIM20_CCMR2_CC3S_B_0X2      (0x2u<<0)
#define TIM20_CCMR2_CC3S_B_0X3      (0x3u<<0)

// CCER Configuration

#define TIM20_CCER_CC6P             (0x1u<<21)
#define TIM20_CCER_CC6E             (0x1u<<20)
#define TIM20_CCER_CC5P             (0x1u<<17)
#define TIM20_CCER_CC5E             (0x1u<<16)
#define TIM20_CCER_CC4NP            (0x1u<<15)
#define TIM20_CCER_CC4NE            (0x1u<<14)
#define TIM20_CCER_CC4P             (0x1u<<13)
#define TIM20_CCER_CC4E             (0x1u<<12)
#define TIM20_CCER_CC3NP            (0x1u<<11)
#define TIM20_CCER_CC3NE            (0x1u<<10)
#define TIM20_CCER_CC3P             (0x1u<<9)
#define TIM20_CCER_CC3E             (0x1u<<8)
#define TIM20_CCER_CC2NP            (0x1u<<7)
#define TIM20_CCER_CC2NE            (0x1u<<6)
#define TIM20_CCER_CC2P             (0x1u<<5)
#define TIM20_CCER_CC2E             (0x1u<<4)
#define TIM20_CCER_CC1NP            (0x1u<<3)
#define TIM20_CCER_CC1NE            (0x1u<<2)
#define TIM20_CCER_CC1P             (0x1u<<1)
#define TIM20_CCER_CC1E             (0x1u<<0)

#define TIM20_CCER_CC1NP_B_0X0      (0x0u<<3)
#define TIM20_CCER_CC1NP_B_0X1      (0x1u<<3)
#define TIM20_CCER_CC1NE_B_0X0      (0x0u<<2)
#define TIM20_CCER_CC1NE_B_0X1      (0x1u<<2)
#define TIM20_CCER_CC1P_B_0X0       (0x0u<<1)
#define TIM20_CCER_CC1P_B_0X1       (0x1u<<1)
#define TIM20_CCER_CC1E_B_0X0       (0x0u<<0)
#define TIM20_CCER_CC1E_B_0X1       (0x1u<<0)

// CNT Configuration

#define TIM20_CNT_UIFCPY            (0x1u<<31)
#define TIM20_CNT_CNT               (0xFFFFu<<0)
#define TIM20_CNT_CNT_0             (0x1u<<0)

// PSC Configuration

