Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_tim20.h
#define TIM20_PSC_PSC               (0xFFFFu<<0)
#define TIM20_PSC_PSC_0             (0x1u<<0)

// ARR Configuration

#define TIM20_ARR_ARR               (0xFFFFFu<<0)
#define TIM20_ARR_ARR_0             (0x1u<<0)

// RCR Configuration

#define TIM20_RCR_REP               (0xFFFFu<<0)
#define TIM20_RCR_REP_0             (0x1u<<0)

// CCR1 Configuration

#define TIM20_CCR1_CCR1             (0xFFFFFu<<0)
#define TIM20_CCR1_CCR1_0           (0x1u<<0)

// CCR2 Configuration

#define TIM20_CCR2_CCR2             (0xFFFFFu<<0)
#define TIM20_CCR2_CCR2_0           (0x1u<<0)

// CCR3 Configuration

#define TIM20_CCR3_CCR3             (0xFFFFFu<<0)
#define TIM20_CCR3_CCR3_0           (0x1u<<0)

// CCR4 Configuration

#define TIM20_CCR4_CCR4             (0xFFFFFu<<0)
#define TIM20_CCR4_CCR4_0           (0x1u<<0)

// BDTR Configuration

#define TIM20_BDTR_BK2BID           (0x1u<<29)
#define TIM20_BDTR_BKBID            (0x1u<<28)
#define TIM20_BDTR_BK2DSRM          (0x1u<<27)
#define TIM20_BDTR_BKDSRM           (0x1u<<26)
#define TIM20_BDTR_BK2P             (0x1u<<25)
#define TIM20_BDTR_BK2E             (0x1u<<24)
#define TIM20_BDTR_BK2F             (0xFu<<20)
#define TIM20_BDTR_BK2F_0           (0x1u<<20)
#define TIM20_BDTR_BKF              (0xFu<<16)
#define TIM20_BDTR_BKF_0            (0x1u<<16)
#define TIM20_BDTR_MOE              (0x1u<<15)
#define TIM20_BDTR_AOE              (0x1u<<14)
#define TIM20_BDTR_BKP              (0x1u<<13)
#define TIM20_BDTR_BKE              (0x1u<<12)
#define TIM20_BDTR_OSSR             (0x1u<<11)
#define TIM20_BDTR_OSSI             (0x1u<<10)
#define TIM20_BDTR_LOCK             (0x3u<<8)
#define TIM20_BDTR_LOCK_0           (0x1u<<8)
#define TIM20_BDTR_DTG              (0xFFu<<0)
#define TIM20_BDTR_DTG_0            (0x1u<<0)

#define TIM20_BDTR_BKBID_B_0X0      (0x0u<<28)
#define TIM20_BDTR_BKBID_B_0X1      (0x1u<<28)
#define TIM20_BDTR_BKDSRM_B_0X0     (0x0u<<26)
#define TIM20_BDTR_BKDSRM_B_0X1     (0x1u<<26)
#define TIM20_BDTR_BK2P_B_0X0       (0x0u<<25)
#define TIM20_BDTR_BK2P_B_0X1       (0x1u<<25)
#define TIM20_BDTR_BK2E_B_0X0       (0x0u<<24)
#define TIM20_BDTR_BK2E_B_0X1       (0x1u<<24)
#define TIM20_BDTR_BK2F_B_0X0       (0x0u<<20)
#define TIM20_BDTR_BK2F_B_0X1       (0x1u<<20)
#define TIM20_BDTR_BK2F_B_0X2       (0x2u<<20)
#define TIM20_BDTR_BK2F_B_0X3       (0x3u<<20)
#define TIM20_BDTR_BK2F_B_0X4       (0x4u<<20)
#define TIM20_BDTR_BK2F_B_0X5       (0x5u<<20)
#define TIM20_BDTR_BK2F_B_0X6       (0x6u<<20)
#define TIM20_BDTR_BK2F_B_0X7       (0x7u<<20)
#define TIM20_BDTR_BK2F_B_0X8       (0x8u<<20)
#define TIM20_BDTR_BK2F_B_0X9       (0x9u<<20)
#define TIM20_BDTR_BK2F_B_0XA       (0xAu<<20)
#define TIM20_BDTR_BK2F_B_0XB       (0xBu<<20)
#define TIM20_BDTR_BK2F_B_0XC       (0xCu<<20)
#define TIM20_BDTR_BK2F_B_0XD       (0xDu<<20)
#define TIM20_BDTR_BK2F_B_0XE       (0xEu<<20)
#define TIM20_BDTR_BK2F_B_0XF       (0xFu<<20)
#define TIM20_BDTR_BKF_B_0X0        (0x0u<<16)
#define TIM20_BDTR_BKF_B_0X1        (0x1u<<16)
#define TIM20_BDTR_BKF_B_0X2        (0x2u<<16)
#define TIM20_BDTR_BKF_B_0X3        (0x3u<<16)
#define TIM20_BDTR_BKF_B_0X4        (0x4u<<16)
#define TIM20_BDTR_BKF_B_0X5        (0x5u<<16)
#define TIM20_BDTR_BKF_B_0X6        (0x6u<<16)
#define TIM20_BDTR_BKF_B_0X7        (0x7u<<16)
#define TIM20_BDTR_BKF_B_0X8        (0x8u<<16)
#define TIM20_BDTR_BKF_B_0X9        (0x9u<<16)
#define TIM20_BDTR_BKF_B_0XA        (0xAu<<16)
#define TIM20_BDTR_BKF_B_0XB        (0xBu<<16)
#define TIM20_BDTR_BKF_B_0XC        (0xCu<<16)
#define TIM20_BDTR_BKF_B_0XD        (0xDu<<16)
#define TIM20_BDTR_BKF_B_0XE        (0xEu<<16)
#define TIM20_BDTR_BKF_B_0XF        (0xFu<<16)
#define TIM20_BDTR_MOE_B_0X0        (0x0u<<15)
#define TIM20_BDTR_MOE_B_0X1        (0x1u<<15)
#define TIM20_BDTR_AOE_B_0X0        (0x0u<<14)
#define TIM20_BDTR_AOE_B_0X1        (0x1u<<14)
#define TIM20_BDTR_BKP_B_0X0        (0x0u<<13)
#define TIM20_BDTR_BKP_B_0X1        (0x1u<<13)
#define TIM20_BDTR_BKE_B_0X0        (0x0u<<12)
#define TIM20_BDTR_BKE_B_0X1        (0x1u<<12)
#define TIM20_BDTR_OSSR_B_0X0       (0x0u<<11)
#define TIM20_BDTR_OSSR_B_0X1       (0x1u<<11)
#define TIM20_BDTR_OSSI_B_0X0       (0x0u<<10)
#define TIM20_BDTR_OSSI_B_0X1       (0x1u<<10)
#define TIM20_BDTR_LOCK_B_0X0       (0x0u<<8)
#define TIM20_BDTR_LOCK_B_0X1       (0x1u<<8)
#define TIM20_BDTR_LOCK_B_0X2       (0x2u<<8)
#define TIM20_BDTR_LOCK_B_0X3       (0x3u<<8)

// CCR5 Configuration

#define TIM20_CCR5_GC5C3            (0x1u<<31)
#define TIM20_CCR5_GC5C2            (0x1u<<30)
#define TIM20_CCR5_GC5C1            (0x1u<<29)
#define TIM20_CCR5_CCR5             (0xFFFFFu<<0)
#define TIM20_CCR5_CCR5_0           (0x1u<<0)

#define TIM20_CCR5_GC5C3_B_0X0      (0x0u<<31)
#define TIM20_CCR5_GC5C3_B_0X1      (0x1u<<31)
#define TIM20_CCR5_GC5C2_B_0X0      (0x0u<<30)
#define TIM20_CCR5_GC5C2_B_0X1      (0x1u<<30)
#define TIM20_CCR5_GC5C1_B_0X0      (0x0u<<29)
#define TIM20_CCR5_GC5C1_B_0X1      (0x1u<<29)

// CCR6 Configuration

#define TIM20_CCR6_CCR6             (0xFFFFFu<<0)
#define TIM20_CCR6_CCR6_0           (0x1u<<0)

// CCMR3 Configuration

#define TIM20_CCMR3_OC6M_1          (0x1u<<24)
#define TIM20_CCMR3_OC5M_1          (0x1u<<16)
#define TIM20_CCMR3_OC6CE           (0x1u<<15)
#define TIM20_CCMR3_OC6M            (0x7u<<12)
#define TIM20_CCMR3_OC6M_0          (0x1u<<12)
#define TIM20_CCMR3_OC6PE           (0x1u<<11)
#define TIM20_CCMR3_OC6FE           (0x1u<<10)
#define TIM20_CCMR3_OC5CE           (0x1u<<7)
#define TIM20_CCMR3_OC5M            (0x7u<<4)
#define TIM20_CCMR3_OC5M_0          (0x1u<<4)
#define TIM20_CCMR3_OC5PE           (0x1u<<3)
#define TIM20_CCMR3_OC5FE           (0x1u<<2)

// DTR2 Configuration

#define TIM20_DTR2_DTPE             (0x1u<<17)
#define TIM20_DTR2_DTAE             (0x1u<<16)
#define TIM20_DTR2_DTGF             (0xFFu<<0)
#define TIM20_DTR2_DTGF_0           (0x1u<<0)

#define TIM20_DTR2_DTPE_B_0X0       (0x0u<<17)
#define TIM20_DTR2_DTPE_B_0X1       (0x1u<<17)
#define TIM20_DTR2_DTAE_B_0X0       (0x0u<<16)
#define TIM20_DTR2_DTAE_B_0X1       (0x1u<<16)

// ECR Configuration

#define TIM20_ECR_PWPRSC            (0x7u<<24)
#define TIM20_ECR_PWPRSC_0          (0x1u<<24)
#define TIM20_ECR_PW                (0xFFu<<16)
#define TIM20_ECR_PW_0              (0x1u<<16)
#define TIM20_ECR_IPOS              (0x3u<<6)
#define TIM20_ECR_IPOS_0            (0x1u<<6)
#define TIM20_ECR_FIDX              (0x1u<<5)
#define TIM20_ECR_IBLK              (0x3u<<3)
#define TIM20_ECR_IBLK_0            (0x1u<<3)
#define TIM20_ECR_IDIR              (0x3u<<1)
#define TIM20_ECR_IDIR_0            (0x1u<<1)
#define TIM20_ECR_IE                (0x1u<<0)

#define TIM20_ECR_IPOS_B_0X0        (0x0u<<6)
#define TIM20_ECR_IPOS_B_0X1        (0x1u<<6)
#define TIM20_ECR_IPOS_B_0X2        (0x2u<<6)
#define TIM20_ECR_IPOS_B_0X3        (0x3u<<6)
#define TIM20_ECR_FIDX_B_0X0        (0x0u<<5)
#define TIM20_ECR_FIDX_B_0X1        (0x1u<<5)
#define TIM20_ECR_IBLK_B_0X0        (0x0u<<3)
#define TIM20_ECR_IBLK_B_0X1        (0x1u<<3)
#define TIM20_ECR_IBLK_B_0X2        (0x2u<<3)
#define TIM20_ECR_IDIR_B_0X0        (0x0u<<1)
#define TIM20_ECR_IDIR_B_0X1        (0x1u<<1)
#define TIM20_ECR_IDIR_B_0X2        (0x2u<<1)
#define TIM20_ECR_IE_B_0X0          (0x0u<<0)
#define TIM20_ECR_IE_B_0X1          (0x1u<<0)

// TISEL Configuration

#define TIM20_TISEL_TI4SEL          (0xFu<<24)
#define TIM20_TISEL_TI4SEL_0        (0x1u<<24)
#define TIM20_TISEL_TI3SEL          (0xFu<<16)
#define TIM20_TISEL_TI3SEL_0        (0x1u<<16)
#define TIM20_TISEL_TI2SEL          (0xFu<<8)
#define TIM20_TISEL_TI2SEL_0        (0x1u<<8)
#define TIM20_TISEL_TI1SEL          (0xFu<<0)
#define TIM20_TISEL_TI1SEL_0        (0x1u<<0)

